In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data.csv")

In [3]:
print(df)

       Name  Age        City  Salary
0     Alice   45    New york   40000
1       Bob   22      Mumbai   30000
2   Charlie   35        Pune   20000
3  ashutosh   21     Solapur   24000
4   jagdale   66  Pandharpur   10000

In [4]:
df.head(3)

      Name  Age      City  Salary
0    Alice   45  New york   40000
1      Bob   22    Mumbai   30000
2  Charlie   35      Pune   20000

In [5]:
df.tail(3)

       Name  Age        City  Salary
2   Charlie   35        Pune   20000
3  ashutosh   21     Solapur   24000
4   jagdale   66  Pandharpur   10000

In [6]:
df.iloc[0:3,2:4]

       City  Salary
0  New york   40000
1    Mumbai   30000
2      Pune   20000

In [7]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      str
 1   Age     5 non-null      int64
 2   City    5 non-null      str
 3   Salary  5 non-null      int64
dtypes: int64(2), str(2)
memory usage: 292.0 bytes

In [8]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   37.800000  24800.000000
std    18.619882  11189.280585
min    21.000000  10000.000000
25%    22.000000  20000.000000
50%    35.000000  24000.000000
75%    45.000000  30000.000000
max    66.000000  40000.000000

In [9]:
df[['Salary','Name','City']]

   Salary      Name        City
0   40000     Alice    New york
1   30000       Bob      Mumbai
2   20000   Charlie        Pune
3   24000  ashutosh     Solapur
4   10000   jagdale  Pandharpur

In [10]:
df.shape

(5, 4)

In [11]:
df.take([1,4])

      Name  Age        City  Salary
1      Bob   22      Mumbai   30000
4  jagdale   66  Pandharpur   10000

In [12]:
df.take([1,4])["Salary"]

1    30000
4    10000
Name: Salary, dtype: int64

In [13]:
df['Age']>25

0     True
1    False
2     True
3    False
4     True
Name: Age, dtype: bool

In [14]:
df[df['Age']>25]

      Name  Age        City  Salary
0    Alice   45    New york   40000
2  Charlie   35        Pune   20000
4  jagdale   66  Pandharpur   10000

In [15]:
df['Bonus']=df['Salary'] *0.10

In [16]:
print(df)

       Name  Age        City  Salary   Bonus
0     Alice   45    New york   40000  4000.0
1       Bob   22      Mumbai   30000  3000.0
2   Charlie   35        Pune   20000  2000.0
3  ashutosh   21     Solapur   24000  2400.0
4   jagdale   66  Pandharpur   10000  1000.0

In [17]:
df.at[2,'City']='boston'

In [18]:
df

       Name  Age        City  Salary   Bonus
0     Alice   45    New york   40000  4000.0
1       Bob   22      Mumbai   30000  3000.0
2   Charlie   35      boston   20000  2000.0
3  ashutosh   21     Solapur   24000  2400.0
4   jagdale   66  Pandharpur   10000  1000.0

In [19]:
df[df['Salary']>35000]

    Name  Age      City  Salary   Bonus
0  Alice   45  New york   40000  4000.0

In [20]:
df[(df['Salary']>25000)&(df['Age']>20)]

    Name  Age      City  Salary   Bonus
0  Alice   45  New york   40000  4000.0
1    Bob   22    Mumbai   30000  3000.0

In [21]:
df

       Name  Age        City  Salary   Bonus
0     Alice   45    New york   40000  4000.0
1       Bob   22      Mumbai   30000  3000.0
2   Charlie   35      boston   20000  2000.0
3  ashutosh   21     Solapur   24000  2400.0
4   jagdale   66  Pandharpur   10000  1000.0

In [22]:
df.at[4,"Name"]="Rajendra"

In [23]:
df

       Name  Age        City  Salary   Bonus
0     Alice   45    New york   40000  4000.0
1       Bob   22      Mumbai   30000  3000.0
2   Charlie   35      boston   20000  2000.0
3  ashutosh   21     Solapur   24000  2400.0
4  Rajendra   66  Pandharpur   10000  1000.0

In [24]:
df.drop(columns="Bonus",inplace=True)

In [25]:
df

       Name  Age        City  Salary
0     Alice   45    New york   40000
1       Bob   22      Mumbai   30000
2   Charlie   35      boston   20000
3  ashutosh   21     Solapur   24000
4  Rajendra   66  Pandharpur   10000

In [26]:
x=[{"Name":"John","Age":44,"City":"Pune","Salary":75000},{"Name":"Cena","Age":75,"City":"Dubai","Salary":65000}]
print(type(x))

<class 'list'>

In [27]:
print(type(df))

<class 'pandas.DataFrame'>

In [28]:
y=pd.DataFrame(x)

In [29]:
print(type(y),type(df))

<class 'pandas.DataFrame'> <class 'pandas.DataFrame'>

In [30]:
df=pd.concat([df,y],ignore_index=True)

In [31]:
df

       Name  Age        City  Salary
0     Alice   45    New york   40000
1       Bob   22      Mumbai   30000
2   Charlie   35      boston   20000
3  ashutosh   21     Solapur   24000
4  Rajendra   66  Pandharpur   10000
5      John   44        Pune   75000
6      Cena   75       Dubai   65000